In [1]:
import pandas as pd
import numpy as np

In [2]:
dict = {'Col1':[1,2,3,np.nan],
 'Col2':[4,np.nan,6,7],
 'Col3':['a','b','c', None]
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

In [5]:
# Funciones de Pandas para Datos Nulos

df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [6]:
# De esta manera dejamos de forma num√©rica los valores nulos

df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

In [7]:
# Completar con un valor valores nulos

df.fillna('Missing')

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [8]:
# Puedo decidir con que valores se completan los valores nulos

df.fillna(df.mean())

C:\Users\gonza\AppData\Local\Temp/ipykernel_5612/634187881.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

In [9]:
# Otro modo de completar los valores nulos
# Usamos la interpolaci√≥n
# Nos sirve para llenar cuando haya una secuencia num√©rica clara

df.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

In [10]:
# Tambi√©n podemos eliminar los valores nulos

df.dropna()

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c